---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent
source: html/44fd9a1b-55a9-999a-a8bb-02f347e86d2e.htm
---
# KeyBasedTreeEntriesLoadContent Members

Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function.